{
  "model_type": "gpt_oss_lite_minimal",
  "architectures": [
    "GPTOSSLiteForCausalLM"
  ],
  "hidden_size": 2880,
  "intermediate_size": 2880,
  "num_hidden_layers": 24,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "vocab_size": 201088,
  "num_local_experts": 6,
  "num_experts_per_tok": 4,
  "rope_scaling": {
    "type": "yarn",
    "factor": 10.0,
    "original_max_position_embeddings": 16384
  },
  "hot_experts_by_layer": {
    "0": [
      5,
      9,
      17,
      19,
      25,
      31
    ],
    "1": [
      6,
      14,
      22,
      25,
      26,
      27
    ],
    "2": [
      7,
      20,
      23,
      26,
      27,
      29
    ],
    "3": [
      0,
      1,
      6,
      14,
      21,
      31
    ],
    "4": [
      1,
      6,
      10,
      19,
      23,
      27
    ],
    "5": [
      3,
      8,
      11,
      24,
      25,
      26
    ],
    "6": [
      2,
      5,
      15,
      21,
      24,
      27
    ],
    "7": [
      0,
      3,
      5,
      19,
      22,
      23
    ],
    "8": [
      4,
      8,
      9,
      17,
      21,
      23
    ],
    "9": [
      2,
      15,
      16,
      18,
      19,
      31
    ],
    "10": [
      6,
      7,
      9,
      10,
      16,
      28
    ],
    "11": [
      2,
      5,
      18,
      25,
      26,
      30
    ],
    "12": [
      6,
      9,
      14,
      15,
      21,
      23
    ],
    "13": [
      3,
      4,
      9,
      21,
      25,
      27
    ],
    "14": [
      0,
      6,
      16,
      18,
      20,
      29
    ],
    "15": [
      1,
      7,
      13,
      17,
      24,
      29
    ],
    "16": [
      4,
      13,
      14,
      18,
      24,
      31
    ],
    "17": [
      2,
      5,
      14,
      21,
      22,
      24
    ],
    "18": [
      1,
      7,
      18,
      22,
      25,
      31
    ],
    "19": [
      0,
      4,
      11,
      17,
      21,
      28
    ],
    "20": [
      7,
      8,
      12,
      19,
      22,
      29
    ],
    "21": [
      3,
      10,
      17,
      23,
      25,
      28
    ],
    "22": [
      5,
      13,
      19,
      25,
      26,
      27
    ],
    "23": [
      8,
      10,
      14,
      16,
      18,
      31
    ]
  },
  "source_model": "openai/gpt-oss-20b",
  "total_experts": 144,
  "original_experts": 768,
  "reduction_percent": "81.2%"
}