{
  "model_type": "gpt_oss_lite_minimal",
  "architectures": [
    "GPTOSSLiteForCausalLM"
  ],
  "hidden_size": 2880,
  "intermediate_size": 2880,
  "num_hidden_layers": 24,
  "num_attention_heads": 64,
  "num_key_value_heads": 8,
  "vocab_size": 201088,
  "num_local_experts": 16,
  "num_experts_per_tok": 4,
  "rope_scaling": {
    "type": "yarn",
    "factor": 10.0,
    "original_max_position_embeddings": 16384
  },
  "hot_experts_by_layer": {
    "0": [
      2,
      3,
      5,
      9,
      11,
      13,
      14,
      16,
      17,
      18,
      19,
      21,
      22,
      25,
      29,
      31
    ],
    "1": [
      3,
      6,
      8,
      9,
      13,
      14,
      16,
      17,
      20,
      22,
      23,
      24,
      25,
      26,
      27,
      28
    ],
    "2": [
      2,
      3,
      5,
      7,
      15,
      18,
      20,
      21,
      23,
      24,
      25,
      26,
      27,
      28,
      29,
      31
    ],
    "3": [
      0,
      1,
      6,
      7,
      10,
      11,
      12,
      14,
      18,
      19,
      21,
      22,
      23,
      28,
      29,
      31
    ],
    "4": [
      1,
      2,
      4,
      6,
      8,
      10,
      13,
      14,
      17,
      19,
      20,
      23,
      24,
      27,
      28,
      30
    ],
    "5": [
      2,
      3,
      4,
      6,
      8,
      10,
      11,
      14,
      15,
      16,
      17,
      24,
      25,
      26,
      30,
      31
    ],
    "6": [
      2,
      5,
      9,
      10,
      12,
      15,
      16,
      20,
      21,
      24,
      25,
      26,
      27,
      29,
      30,
      31
    ],
    "7": [
      0,
      3,
      5,
      8,
      14,
      15,
      17,
      18,
      19,
      22,
      23,
      24,
      26,
      28,
      29,
      30
    ],
    "8": [
      0,
      4,
      5,
      8,
      9,
      11,
      12,
      13,
      15,
      17,
      18,
      19,
      20,
      21,
      23,
      24
    ],
    "9": [
      0,
      1,
      2,
      4,
      5,
      6,
      12,
      14,
      15,
      16,
      17,
      18,
      19,
      23,
      26,
      31
    ],
    "10": [
      4,
      6,
      7,
      8,
      9,
      10,
      12,
      13,
      16,
      19,
      21,
      24,
      25,
      28,
      29,
      31
    ],
    "11": [
      1,
      2,
      4,
      5,
      6,
      10,
      12,
      14,
      15,
      16,
      18,
      19,
      21,
      25,
      26,
      30
    ],
    "12": [
      4,
      5,
      6,
      7,
      8,
      9,
      11,
      14,
      15,
      17,
      19,
      21,
      23,
      25,
      26,
      27
    ],
    "13": [
      1,
      2,
      3,
      4,
      5,
      6,
      8,
      9,
      10,
      21,
      22,
      24,
      25,
      27,
      28,
      30
    ],
    "14": [
      0,
      3,
      5,
      6,
      12,
      13,
      14,
      15,
      16,
      17,
      18,
      20,
      23,
      25,
      29,
      30
    ],
    "15": [
      1,
      4,
      5,
      7,
      8,
      10,
      13,
      15,
      16,
      17,
      19,
      21,
      22,
      24,
      27,
      29
    ],
    "16": [
      4,
      5,
      6,
      8,
      11,
      13,
      14,
      18,
      19,
      24,
      26,
      27,
      28,
      29,
      30,
      31
    ],
    "17": [
      2,
      4,
      5,
      7,
      10,
      12,
      14,
      15,
      19,
      21,
      22,
      23,
      24,
      25,
      30,
      31
    ],
    "18": [
      0,
      1,
      3,
      6,
      7,
      9,
      10,
      13,
      14,
      17,
      18,
      22,
      24,
      25,
      27,
      31
    ],
    "19": [
      0,
      3,
      4,
      5,
      6,
      7,
      9,
      11,
      15,
      17,
      19,
      21,
      25,
      27,
      28,
      31
    ],
    "20": [
      3,
      6,
      7,
      8,
      10,
      12,
      14,
      15,
      16,
      19,
      20,
      22,
      23,
      29,
      30,
      31
    ],
    "21": [
      1,
      2,
      3,
      6,
      7,
      9,
      10,
      12,
      13,
      15,
      17,
      20,
      21,
      23,
      25,
      28
    ],
    "22": [
      0,
      3,
      4,
      5,
      7,
      8,
      13,
      15,
      19,
      21,
      22,
      23,
      25,
      26,
      27,
      29
    ],
    "23": [
      0,
      5,
      6,
      8,
      10,
      14,
      15,
      16,
      17,
      18,
      22,
      25,
      26,
      27,
      28,
      31
    ]
  },
  "source_model": "openai/gpt-oss-20b",
  "total_experts": 384,
  "original_experts": 768,
  "reduction_percent": "50.0%"
}